import streamlit as st
from PIL import Image
from datetime import timedelta
from bollinger import Bollinger

class WebApplication :
    def __init__(self):
        st.title("""주식 예측 프로그램""")
        st.text("\n")

        original_title = '<p style="font-family:Courier; color:Red; font-size: 15px;">※주의※</p>'
        st.markdown(original_title, unsafe_allow_html=True)
        original_title = '<p style="font-family:Courier; color:Red; font-size: 15px;">상장이 3년이 안된 주가에대한 데이터의 예측확률은 매우 떨어질 것으로 보임.</p>'
        st.markdown(original_title, unsafe_allow_html=True)
        original_title = '<p style="font-family:Courier; color:Red; font-size: 15px;"> 데이터를 주식 투자에 사용할 경우 책임은 전적으로 투자자에게 있음.</p>'
        st.markdown(original_title, unsafe_allow_html=True)

        st.sidebar.header('유저 설정')
        st.sidebar.text("\n")

        self.Picompname = ['하이스틸', 'POSCO', '영흥', '부국철강', 'DSR제강', 'NI스틸', '고려제강', '한일철강', '대한제강', 'KG동부제철우',
                      'KG동부제철', '세아베스틸', '조선선재', '동국제강', '현대제철', '휴스틸', '한국주철관', '동양철관', '한국주강',
                      '한국철강', '동일산업', '세아제강지주', '화인베스틸', '세아제강', 'KISCO홀딩스', '세아홀딩스', 'CS홀딩스',
                      '만호제강', '세아특수강', '한국특수형강', '문배철강', '신화실업', '동일제강', 'TCC스틸', '대교', '웅진씽크빅',
                      '대교우B', '비상교육', 'GKL', '강원랜드', '이월드', '신세계푸드', '하나투어', '용평리조트', '호텔신라우', '호텔신라', '롯데관광개발',
                      '하이트진로', '롯데칠성', '하이트진로홀딩스우', '하이트진로2우B', '하이트진로홀딩스', '보해양조', '무학', '롯데칠성우', 'MH에탄올',
                      '씨아이테크', '주연테크', '센트럴인사이트', '삼익악기', '제이콘텐트리', 'IHQ', 'CJ CGV', '갤럭시아에스엠',
                      '현대퓨처넷', 'SBS미디어홀딩스', '빅히트', '키위미디어그룹', '세기상사', 'LG헬로비전', '스카이라이프',
                      'YG PLUS', '엔케이물산', 'SBS', '이스타코', '제주은행', 'DGB금융지주', 'JB금융지주', '신한지주',
                      'KB금융', 'BNK금융지주', '하나금융지주', '기업은행', '우리금융지주', '쎌마테라퓨틱스', '세우글로벌', '신도리코',
                      'KCTC', 'CJ제일제당', '인터지스', 'CJ제일제당 우', '세방', 'CJ대한통운', '한진', '세방우', '동방', '유수홀딩스',
                      '한익스프레스', '현대글로비스', '국보', '한솔로지스틱스', '덕성', '덕성우', '진도', '삼양통상', '형지엘리트',
                      '백산', '효성티앤씨', '휠라홀딩스', '신세계인터내셔날', '영원무역홀딩스', '대원화성', '한세엠케이', 'TBH글로벌',
                      '영원무역', '전방', '한섬', '방림', '조광피혁', 'LF', '메타랩스', '경방', '신영와코루', '일신방직', '대한방직',
                      '비비안', '신원우', '신성통상', '유니켐', '한세실업', '쌍방울', '대현', '휴비스', '인디에프', '제이에스코퍼레이션',
                      '국동', 'LS네트웍스', '화승인더', 'SG세계물산', '신원', 'F&F', '코오롱머티리얼', 'BYC', '화승엔터프라이즈', '태평양물산',
                      '한세예스24홀딩스', '호전실업', '윌비스', 'BYC우', '웰바이오텍', '인바이오젠', 'DI동일', '성안', 'GS글로벌',
                      'LG상사', '현대상사', 'STX', '포스코인터내셔널', '롯데하이마트', '진에어', '제주항공', '티웨이홀딩스', '티웨이항공',
                      '아시아나항공', '대한항공', '대한항공우', '에어부산', '한진칼우', '한진칼', '코스맥스', '아모레퍼시픽우', '아모레퍼시픽',
                      '한국화장품제조', '잇츠한불', '아모레G', '한국콜마', '제이준코스메틱', '아모레G3우(전환)', '한국콜마홀딩스', '에이블씨엔씨',
                      '폴루스바이오팜', '애경산업', '토니모리', '한국화장품', 'LG생활건강우', 'LG생활건강', '아모레G우', '이아이디', '경동인베스트',
                      'S-Oil', 'S-Oil우', '대성산업', '극동유화', 'SK이노베이션우', '한국쉘석유', 'SK이노베이션', 'GS우', 'GS', '미창석유',
                      '현대중공업지주', '세원셀론텍', 'SK디스커버리', 'SK디스커버리우', '진양화학', '효성첨단소재', '진양산업', '진양폴리',
                      'NPC', '테이팩스', 'OCI', '효성화학', '포스코케미칼', '금호석유', '한솔케미칼', '그린케미칼', '금양', '금호석유우',
                      '삼영무역', '경농', 'NPC우', '백광산업', '파미셀', '이화산업', '코오롱인더', '성보화학', '미원에스씨', '영보화학',
                      '미원상사', '동성화학', '미원홀딩스', '휴켐스', '동남합성', '코스모화학', '코오롱인더우', 'LG화학', '유니드',
                      '진양홀딩스', '동방아그로', '동성코퍼레이션', 'AK홀딩스', '남해화학', '코오롱', '경인양행', '국도화학', 'SH에너지화학',
                      '코오롱우', 'WISCOM', 'KPX케미칼', '대한유화', '코오롱플라스틱', '송원산업', '미원화학', '삼영화학', 'KPX홀딩스',
                      '이수화학', 'LG화학우', '애경유화', '한화솔루션우', '태경케미컬', '조비', '후성', '롯데케미칼', '코스모신소재',
                      '롯데정밀화학', '대한화섬', 'KG케미칼', 'SKC', '한화솔루션', '카프로', '태광산업', '한국석유', 'SK케미칼우',
                      '한농화성', 'SK케미칼', '금강공업우', '대림통상', '대림B&Co', '다스코', '금강공업', '인스코비', 'KT', '신세계',
                      '현대백화점', 'BGF', 'GS리테일', '롯데쇼핑', '대구백화점', '이마트', '세이브존I&C', '광주신세계', 'BGF리테일',
                      '쿠쿠홀딩스', '신일전자', '쿠쿠홈시스', '코웨이', '경동나비엔', '케이탑리츠', 'SK디앤디', 'ESR켄달스퀘어리츠',
                      '한국자산신탁', '이리츠코크렙', '코람코에너지리츠', '이지스레지던스리츠', '에이리츠', '제이알글로벌리츠',
                      '한국토지신탁', 'NH프라임리츠', '신한알파리츠', '모두투어리츠', '미래에셋맵스리츠', '롯데리츠', '이지스밸류리츠',
                      '한창', '한샘', '시디즈', '지누스', '퍼시스', '현대리바트', '코아스', '에넥스', '크라운해태홀딩스우', '크라운제과우',
                      '동서', '동원F&B', '롯데푸드', '남양유업우', '크라운해태홀딩스', '사조오양', '해태제과식품', '삼양홀딩스우', '동원산업',
                      '오리온', '빙그레', '삼양식품', '삼양홀딩스', '교촌에프앤비', 'SPC삼립', '삼양사', '농심홀딩스', '한성기업',
                      '대상홀딩스우', '동원수산', '오뚜기', '보락', '오리온홀딩스', '풀무원', '대한제당', '삼양사우', '마니커', '롯데지주우',
                      '대상', '조흥', '대상홀딩스', '남양유업', '대한제분', '신라교역', '농심', '사조대림', '고려산업', '우성사료', '샘표',
                      '샘표식품', 'CJ씨푸드1우', '서울식품', '대상우', 'CJ씨푸드', '롯데제과', '사조씨푸드', '크라운제과', '롯데지주',
                      '사조산업', '팜스코', '서울식품우', '선진', '사조동아원', '대한제당우', '현대홈쇼핑', '엔에스쇼핑', '대덕1우',
                      '우리금융캐피탈', '우리종금', '대덕', '텔코웨어', '더존비즈온', '성신양회우', '노루홀딩스우', '유니온', '노루페인트우',
                      '쌍용양회', '조광페인트', '한일시멘트', '일신석재', 'KCC', '넥스트사이언스', '동양우', '삼일씨엔에스',
                      '노루홀딩스', '동양2우B', '노루페인트', '아세아시멘트', '한솔홈데코', '케이씨씨글라스', 'LG하우시스', '한일홀딩스',
                      '부산산업', 'LG하우시스우', '동양', '한일현대시멘트', '성신양회', '벽산', '이건산업', '강남제비스코', '동양3우B',
                      '삼화페인트', '성창기업지주', '영풍제지', '한솔제지', '깨끗한나라우', '무림페이퍼', '컨버즈', '깨끗한나라', '한솔홀딩스',
                      '무림P&P', '선창산업', '한솔PNS', '페이퍼코리아', 'KTcs', 'NICE', 'KTis', '아이마켓코리아', '에스원', '효성ITX',
                      '삼양패키징', '대영포장', '락앤락', '원림', '신풍제지', '신대양제지', '세하', '동원시스템즈우', '아세아', '금비',
                      '태림포장', '한창제지', '삼화왕관', '한국수출포장', '아세아제지', '율촌화학', '동원시스템즈',
                      '부산가스', '인천도시가스', '대성에너지', '경동도시가스', '예스코홀딩스', '대성홀딩스', '한진중공업홀딩스', 'SK가스',
                      '서울가스', '삼천리', 'E1', '한국가스공사''코리안리', '메리츠금융지주', '흥국화재', '한화손해보험', '현대해상',
                      '삼성화재우', '흥국화재우', '에이플러스에셋', '흥국화재2우B', '삼성화재', '롯데손해보험', '메리츠화재', 'DB손해보험',
                      '서원', '대창', '남선알미늄', '포스코강판', '알루코', 'DSR', '태경산업', '일진다이아', '조일알미늄', '태경비케이',
                      '남선알미우', '대호에이엘', '이구산업', '제일연마', '황금에스티', '현대비앤지스틸우', '조선내화', '삼아알미늄',
                      '고려아연', '현대비앤지스틸', '대양금속', '디씨엠', '풍산홀딩스', '한국내화', '풍산', '신송홀딩스', '현대그린푸드',
                      '현대코퍼레이션홀딩스', 'KT&G', '한전기술', '한전KPS', '한국전력', '한전산업', 'SGC에너지', '현대에너지솔루션',
                      '삼부토건', '진흥기업', '금호산업', '남광토건', '도화엔지니어링', '코오롱글로벌우', '티와이홀딩스우', '까뮤이앤씨',
                      '진흥기업우B', '태영건설', '일성건설', '삼호개발', '아이에스동서', '티와이홀딩스', '에쓰씨엔지니어링', 'DL이앤씨',
                      '진흥기업2우B', '동부건설', '태영건설우', '한국종합기술', '삼성엔지니어링', '범양건영', '동부건설우',
                      '한라', '자이에스앤디', '금호산업우', 'DL이앤씨우', '코오롱글로벌', '한신공영', '한진중공업', '화성산업',
                      '현대건설', 'HDC', '동아지질', '현대건설우', 'HDC아이콘트롤스', '한미글로벌', '신세계건설', 'HDC현대산업개발', '계룡건설',
                      'DL우', '대우건설', 'GS건설', '대림건설', '우진아이엔에스', 'DL', '맥쿼리인프라', '한국공항',
                      '종근당', '유나이티드제약', '종근당바이오', '종근당홀딩스', '현대약품', '유유제약', '한미약품', '일성신약',
                      '셀트리온', '하나제약', '경보제약', '코스맥스비티아이', 'JW중외제약', '동아에스티', 'JW중외제약2우B',
                      '광동제약', '녹십자홀딩스', 'JW홀딩스', '녹십자', '한미사이언스', '유유제약1우', '대원제약', '삼일제약', '동성제약',
                      'JW생명과학', '일동홀딩스', '동아쏘시오홀딩스', '유유제약2우B', '삼진제약', '국제약품', '환인제약', '유한양행우',
                      '이연제약', '삼성바이오로직스', '우리들제약', '일동제약', '제일파마홀딩스', '에이프로젠제약', '한독', '영진약품',
                      '한올바이오파마', '명문제약', '유한양행', '보령제약', 'JW중외제약우', '제일약품', '대웅', '동화약품', 'SK바이오팜',
                      '대웅제약', '신풍제약우', '신풍제약', '녹십자홀딩스2우', '프레스티지바이오파마', '삼성제약', '부광약품', '일양약품우',
                      '일양약품', 'HSD엔진', '현대미포조선', '삼성중공업', '대우조선해양', 'STX엔진', '삼성중공우', 'STX중공업', '한국카본',
                      '한국조선해양', '세진중공업', '엔씨소프트', '넷마블', '더블유게임즈', 'NHN', 'LG디스플레이', '일진디스플',
                      '화천기계', '큐로', 'SIMPAC', '혜인', '기신정기', '디와이파워', 'S&TC', '우진', '화천기공', '대창단조',
                      '엔케이', '대동공업', '에이프로젠 KIC', '두산밥캣', '한신기계', '현대엘리베이', '두산인프라코어',
                      '삼익THK', '현대로템', '두산중공업', '동양물산', '현대건설기계', '우진플라임', '이엔플러스', 'KC그린홀딩스',
                      'KC코트렐', '수산중공업', '씨에스윈드', '서연', '서연이화', '태양금속', '태양금속우', '대유에이텍', '일정실업',
                      '새론오토모티브', 'S&T중공업', 'SG충방', '삼원강재', '계양전기', '유성기업', '세화아이엠씨', '우신시스템',
                      '한국프랜지', 'S&T홀딩스', '부산주공', '넥센', 'DRB동일', '영화금속', '금호에이치티', 'SJM홀딩스', '디티알오토모티브',
                      '태원물산', '현대위아', '만도', '넥센타이어', '두올', '넥센타이어1우B', '넥센우', '삼성공조', '지코', '화승알앤에이',
                      '세원정공', '유니온머티리얼', '대원강업', 'SJM', '평화홀딩스', 'S&T모티브', '동양피스톤', '동일고무벨트', '계양전기우',
                      '동아타이어', '세종공업', '한라홀딩스', '금호타이어', '핸즈코퍼레이션', '평화산업', '대우부품', '체시스', '대유플러스',
                      '현대모비스', '한온시스템', 'HDC현대EP', '동원금속', '인지컨트롤스', '인팩', '화신', '에스엘', '명신산업',
                      '디아이씨', '세방전지', '티에이치엔', '상신브레이크', '지엠비코리아', '한국단자', '한국앤컴퍼니', '케이비아이동국실업',
                      '덕양산업', '센트랄모텍', '모토닉', '한국타이어앤테크놀로지', '신흥', '덴티움', '지역난방공사',
                      'KTB투자증권', '대신증권우', '메리츠증권', '한양증권우', '대신증권2우B', '현대차증권', '대신증권', '유화증권',
                      '신영증권우', '신영증권', '상상인증권', '미래에셋대우2우B', 'SK증권', '유화증권우', '한국금융지주우', '부국증권',
                      '유안타증권우', '부국증권우', '삼성증권', '교보증권', 'NH투자증권우', '한양증권', '미래에셋대우우', 'DB금융투자',
                      'NH투자증권', '미래에셋대우', '한국금융지주', '유안타증권', '유진투자증권', '한화투자증권', '한화투자증권우', '키움증권',
                      'SK증권우', 'GS글로벌', 'LG상사', 'STX', '현대상사', '포스코인터내셔널', '바다로19호', '하이골드3호', '흥아해운',
                      '하이골드12호', 'HMM', 'KSS해운', '팬오션', '대한해운', '동양생명', '미래에셋생명', '한화3우B', '한화우', '삼성생명',
                      '한화생명', '한화', 'DB', '유엔젤', '현대오토에버', '다우기술', '콤텍시스템', '미래아이앤지', '롯데정보통신', '삼성에스디에스',
                      '우리들휴브레인', '아시아나IDT', '비케이탑스', '신세계 I&C', '참엔지니어링', '금호전기', '한솔테크닉스', '유양디앤유',
                      '이노션', '제일기획', '지투알', '삼정펄프', '모나리자', '일진전기', '선도전기', '효성중공업', '광명전기', '일진홀딩스',
                      '현대일렉트릭', '대원전선우', 'LS전선아시아', '가온전선', 'LS ELECTRIC', '대원전선', 'LS', '대한전선',
                      '삼성카드', '서흥', '영풍', '드림텍', '동양고속', 'AJ네트웍스', '천일고속', 'SK렌터카', '써니전자', '남성', 'LG이노텍',
                      '삼화전자', '솔루스첨단소재2우B', '코리아써키트2우B', '코리아써키트', '코리아써우', '대덕전자', '자화전자',
                      '솔루스첨단소재1우', '대덕전자1우', '광전자', '이수페타시스', '대동전자', '삼성전기우', '에이엔피', '솔루엠',
                      '삼성전기', '솔루스첨단소재', '일진머티리얼즈', '웅진', '효성', '두산우', 'SK네트웍스', 'SK네트웍스우',
                      'CJ우', 'CJ', '두산2우B', '두산', '삼성물산우B', 'LG우', 'SK우', 'CJ4우(전환)', '삼성물산', 'SK', 'LG',
                      '오리엔트바이오', '진원생명과학', 'KR모터스', '엘브이엠씨홀딩스', '쌍용차', '현대차3우B', '현대차2우B', '기아차',
                      '현대차', '현대차우', '케이씨', '디아이', '한국전자홀딩스', '한미반도체', '삼성전자우', 'KEC', '삼성전자',
                      '케이씨텍', 'DB하이텍1우', '신성이엔지', '미래산업', 'SK하이닉스', 'DB하이텍', '유니퀘스트', '해성디에스',
                      '휴니드', 'LIG넥스원', '한화에어로스페이스', '한국항공우주', '퍼스텍', '한화시스템', '키다리스튜디오', 'NAVER', '카카오',
                      '성문전자', '디피씨', '삼영전자', '삼성SDI우', '두산퓨얼셀', '삼화콘덴서', '삼화전기', '삼성SDI', '두산퓨얼셀2우B',
                      '필룩스', '두산퓨얼셀1우', '성문전자우', 'LG유플러스', 'SK텔레콤', '하이트론', '모나미', '삼성출판사', '아남전자',
                      'LG전자우', 'LG전자', '경인전자']

        self.Dakcompname = ['포스코엠텍', '유에스티', '금강철강', '동양에스텍', '삼현철강', '대창스틸', '대호피앤씨', '대동스틸',
                       '동일철강', '대호피앤씨우', '원일특강', '경남스틸', '한국선재', '광진실업', '동국산업', '제일제강', '휴먼엔',
                       '해마로푸드서비스', '파라다이스', '남화산업', '시공테크', '노랑풍선', '모두투어', '참좋은여행', 'MP그룹',
                       '아난티', '서부T&D', '세중', '디딤', 'NE능륭', 'YBM넷', '로보로보', '메가스터디교육', '로보티즈', '청담러닝',
                       '메가엠디', '정상제이엘에스', '메가스터디', '더블유에프엠', '이퓨쳐', '멀티캠퍼스', '아이비김영', '디지털대성',
                       'UCI', '아이스크림에듀', '씨엠에스에듀', '진로발효', '창해에탄올', '풍국주정', '국순당', '네이처셀', '흥국에프엔비',
                       '에이텍티앤', '에이텍', '엔에스엔', '케이씨티', '디지아이', '한국정보공학', '빅솔론', '우리로', '에이루트', '한프',
                       '엠젠플러스', '잉크테크', '푸른기술', '피씨디렉트', '딜리', '메디프론', '파커스', '아이디피', '앱코', '손오공', '삼천리자전거',
                       '알톤스포츠', '헝셩그룹', '골프존뉴딘홀딩스', '이녹스', '라이브플렉스', '오로라', '지니뮤직', '팬엔터테인먼트', 'KMH',
                       '삼화네트웍스', 'NEW', '에이스토리', '덱스터', '위지윅스튜디오', '큐로홀딩스', '와이지엔터테인먼트', '키이스트', '코퍼스코리아',
                       '티비씨', 'CJ ENM', '한국경제TV', '소리바다', '대원미디어', '에스엠', '초록뱀', 'NHN벅스', '쇼박스', '큐브엔터', '스튜디오산타클로스',
                       '씨씨에스', '드림어스컴퍼니', '레드로버', '제이웨이', '이에스에이', '스튜디오드래곤', 'YTN', 'SM Life Design', 'iMBC',
                       '판타지오', '에프엔씨엔터', 'SBS콘텐츠허브', 'KNN', '바른손이앤에이', '애니플러스', '아이오케이', 'JYP Ent.', '상상인', '에코바이오',
                       'YW', '서울옥션', '큐렉소', '슈펙스비앤피', '코오롱티슈진', '대명소노시즌', '하나머스트7호스팩', '상상인이안1호스팩', '리더스 기술투자',
                       '나우IB', '큐캐피탈', '컴퍼니케이', '미래에셋대우스팩4호', '우리기술투자', '한화에스비아이스팩', 'SV인베스트먼트', '미래에셋벤처투자',
                       '하나금융14호스팩', '유안타제7호스팩', '에이치엠씨제4호스팩', '교보10호스팩', '하나머스트제6호스팩', 'TS인베스트먼트', '에이치엠씨제5호스팩',
                       '유안타제3호스팩', '신영스팩6호', '미래에셋대우스팩5호', '상상인이안제2호스팩', '신한제7호스팩', '신영스팩5호', '이베스트이안스팩1호',
                       '하이제5호스팩', '하나금융17호스팩', '유안타제5호스팩', '키움제5호스팩', '상상이안1호스팩', '유진스팩5호', '대성창투', '하나금융15호스팩',
                       '유안타제6호스팩', 'IBKS제15호스팩', '케이비제20호스팩', '하나금융16호스팩', '한국9호스팩', '케이프이에스제4호', 'IBK제13호스팩',
                       'DB금융스팩8호',
                       '엔에이치스팩17호', '엔에이치스팩18호', '엔에이치스팩16호', 'SK5호스팩', 'SBI인베스트먼트', '엠벤처투자', '에이티넘인베스트', '삼성스팩2호',
                       'SK4호스팩', '유안타제4호스팩', '케이비17호스팩', '유진스팩4호', '케이비제18호스팩', '미래에셋대우스팩3호', 'IBKS제12호스팩', '케이비제19호스팩',
                       '대신밸런스제8호스팩', '교보9호스팩', '대신밸런스제7호스팩', '신한제6호스팩', '이베스트스팩5호', 'SK6호스팩', '한화플러스제1호스팩', '한국제8호스팩',
                       '엔에이치스팩13호', 'IBKS제14호스팩', '린드먼아시아', 'DSC인베스트먼트', '엔에이치스팩14호', '아주IB투자', '삼일', '아즈텍WB', '지엔코',
                       '형지I&C', '까스텔바작', '엠에프엠코리아', '그리티', '에스제이그룹', '디케이앤디', '배럴', '코데즈컴바인', '더네이쳐홀딩스', '패션플랫폼',
                       '원풍물산', '리노스', '토박스코리아', '브랜드엑스코퍼레이션', '제이에스티나', '코웰패션', '크리스에프앤씨', '아가방컴퍼니',
                       '씨앤투스성진', '젬백스링크', '우노앤컴퍼니', '골드퍼시픽', '좋은사람들', '이스트아시아홀딩스', '제로투세븐', '에스티오', '예림당', '제일테크노스',
                       '와토스코리아', '삼목에스폼', 'W홀딩컴퍼니', '뉴보텍', '국영지앤엠', '정산애강', '윈하이텍', '프럼파스트', '이건홀딩스', '덕신하우징',
                       '씨큐브', '씨티케이코스메틱스', '코디', '리더스코스메틱', '엔에프씨', '본느', '바른손', '브이티지엠피', '컬러레이', '오가닉티코스메틱',
                       '세화피앤씨', '코리아나', '코스온', '클리오', '선진뷰티사이언스', 'CSA코스믹', '블러썸엠앤씨', '현대바이오랜드', '에이씨티',
                       '스킨앤스킨', 'MP한강', '잉글우드랩', '제닉', '에스디생명공학', '네오팜', '라파스', '코스메카코리아', '글로본', '에프앤리퍼블릭',
                       '아우딘퓨쳐스', '올리패스', '아이큐어', '현대바이오', '도이치모터스', '포스링크', '씨유메디칼', '세종텔레콤', '한국정보통신', '에이스침대',
                       '듀오백', '오하임아이엔티', '흥구석유', '에스아이리소스', '위즈코프', '중앙에너비스', '대한그린파워', '대정화금', '스타플렉스', '케이디켐',
                       '티케이케미칼', '전진바이오팜', '에코프로', '한국알콜', '크리스탈신소재', '엔피케이', '웹스', '오공', '원풍', '쎄노텍', '한일화학',
                       '미래SCI', 'KCI', '녹원씨엔아이', '피엔에이치테크', '와이엠티', '대유', '나노브릭', '켐트로스', '에스폴리텍', '나노', '인바이오',
                       '켐트로닉스', '원익머트리얼즈', '한국바이오젠', '케이피엠테크', '나노캠텍', '레이크머티리얼즈', '동성화인텍', '스카이이앤엠', '자안',
                       '효성오앤비', 'PI첨단소재', '와이오엠', '원익큐브', '레몬', '이엔에프테크놀로지', '나노신소재', '석경에이티', '이엔드디', 'HRS', '해성산업',
                       'JTC', '베뉴지', '케어랩스', '뷰노', '제이엘케이', '솔본', '인피니트헬스케어', '천랩', '이지케어텍', '유비케어', '비트컴퓨터',
                       '선광', '토탈소프트', '부방', '위니아딤채', '파세코', 'PN풍년', '유진로봇', '위닉스', '자이글', '엔바이오니아', '한독크린텍', '오텍',
                       '신성델타테크', '하츠', 'KTH', 'GS홈쇼핑', '코리아센터', '지와이커머스', '포티스', '아이에스이커머스', '이상네트웍스',
                       '예스24', '인터파크', '다나와', '티플랙스', '한창산업', '피제이메탈', '국일신동', '케이피티유', '그린플러스', '동국알앤에스',
                       '제낙스', 'EG', '코센', '쎄니트', '파버나인', '삼보산업', '코닉글로리', '안랩', '모바일리더', '핸디소프트', '라온시큐어', '알체라',
                       '포시에스', '누리텔레콤', '키네마스터', '네이블', '지니언스', '오상자이엘', '한컴위드', 'SGA솔루션즈', '한글과컴퓨터', '시큐브',
                       '포비스티앤씨', '퓨전', '파수', '서호전기', '디지캡', '엔지스테크널러지', '에스에스알', '이스트소프트', '영림원소프트랩', '소프트캠프',
                       '지란지교시큐리티', '웹케시', '링크제니시스', '비즈니스온', '이글루시큐리티', '마이더스AI', '플랜티넷', '더존비즈온', '휴네시온',
                       '인프라웨어', '투비소프트', '윈스', '알티캐스트', '아톤', '한컴MDS', 'SGA', '미디어젠', '엑셈', '이니텍', '드림시큐리티',
                       '바이브컴퍼니', '알서포트', '아이퀘스트', '케이사인', '미래생명자원', '정다운', '대주산업', '신라에스지', '케이씨피드', '이지홀딩스',
                       '푸드웰', '현대사료', '매일홀딩스', '행남사', '윙입푸드', '우양', '메지온', '푸드나무', '체리부로',
                       '마니커에프앤지', '하림지주', '인산가', '동우팜투테이블', '하림', '이지바이오', '엠에스씨', '한일사료', '한국맥널티',
                       '매일유업', '우리손에프앤지', '팜스토리', '한탑', '서산', '라이온켐텍', '홈센타홀딩스', '동양파일', 'SG', '유진기업',
                       '모헨즈', '보광산업', '이엑스티', '센트럴바이오', '삼표시멘트', '에스와이', '고려시멘트', '동화기업', '펌텍코리아', '대륙제관',
                       '연우', '승일', '대양제지', '한국팩키지', '삼보판지', '삼륭물산', '엠투엔', '대림제지', '메이슨캐피탈', '리드코프', '푸른저축은행',
                       '한국캐피탈', 'CNH', '글로벌텍스프리', '버추얼텍', '무림SP', '국일제지', '녹십자랩셀', '서울리거', '신테카바이오', '누리플랜',
                       'NICE평가정보', '자연과환경', '사람인에이치알', '고려신용정보', '한국코퍼레이션', '코엔텍', 'SCI평가정보', '한국기업평가',
                       '나이스디앤비', '이크레더블', '나이스정보통신', '이지웰', '인선이엔티', '제넨바이오', '에이치엘비', '케이프',
                       '오리엔탈정공', '인화정공', '삼영이엔씨', '에스앤더블유', '현진소재', '에이치디', '동방선기', '한라IMS', '메디콕스',
                       '대양전기공업', '케이에스피', '상상인인더스트리', '삼강엠앤티', '한국가구', 'CJ프레시웨이', '네오크레마', '지어소프트', '보라티알',
                       '이베스트투자증권', '코리아에셋투자증권', '다우데이타', '한국테크놀로지', '파라텍', '프리엠스', '자비스', '에너토크',
                       '흥국', '비디아이', '원방테크', '디케이락', '뉴로스', '비에이치아이', '조광ILI', '포메탈', '태광', '에이치케이', '넥스턴',
                       '와이지-원', '코윈테크', '에스에프에이', '대동기어', '아세아텍', '에이비프로바이오', '3S', '화성밸브', '부스타', '코메론',
                       '삼영엠텍', '에버다임', '디에스티', '한국정밀기계', '디와이피엔에프', '동일금속', '강원', '스타모빌리티', '수성', '티에스아이',
                       '광림', '서암기계공업', '레인보우로보틱스', '에이치엘비파워', '대모', '우림기계', '에쎈테크', '스맥', '하이록코리아',
                       'TPC', '이더블유케이', '이엠코리아', '성광벤드', '영풍정밀', '에코마이스터', '제이엔케이히터', '테라사이언스', '씨에스베어링',
                       '휴림로봇', '에스엠코어', '동국S&C', '스페코', '로보스타', '유니슨', '신진에스엠', '대창솔루션', '케이피에프',
                       '진성티이씨', '알에스오토메이션', '비엠티', '태웅', '나라엠앤디', '맥스로텍', '에스피시스템스', '에이테크솔루션', '와이엔텍', '태웅로직스',
                       '이수앱지스', '에이치엘비생명과학', '큐브앤컴퍼니', '비피도', '파마리서치프로덕트', '바이넥스', '셀트리온제약', '카이노스메드',
                       '국전약품', '아미노로직스', '중앙백신', '디에이치피코리아', '셀트리온헬스케어', '압타바이오', '에이치엘비제약', '엔지켐생명과학',
                       '에이치엘사이언스', '테라젠이텍스', '옵티팜', '녹십자웰빙', '박셀바이오', '씨티씨바이오', '동국제약', '고려제약', '코오롱생명과학',
                       '내츄럴엔도텍', '지엘팜텍', '알리코제약', '대봉엘에스', '에이프로젠 H&G', '지놈앤컴퍼니', '드림씨아이에스', '뉴트리',
                       '더블유에스아이', '대화제약', '대한약품', '에스텍파마', '노바렉스', '하이텍팜', '대성미생물', '휴온스글로벌', '우진비앤지',
                       '진바이오텍', '신신제약', '위더스제약', '휴메딕스', '경남제약', '삼아제약', '넥스트BT', '팜스빌', '휴온스', 'JW신약', '메드팩토',
                       '비씨월드제약', '콜마비앤에이치', '안국약품', '진양제약', '코스맥스엔비티', '대한뉴팜', '코미팜', '퓨쳐켐',
                       '브릿지바이오테라퓨틱스', 'CMG제약', '경동제약', '제일바이오', '신일제약', '조아제약', '씨케이에이치', '이글벳', '서울제약',
                       '한국유니온제약', 'KPX생명과학', '티움바이오', '지트리비앤티', '에스티팜', '에스씨엠생명과학', '바이온', '한국파마', '동구바이오제약',
                       '안트로젠', '화일약품', '삼천당제약', '미코바이오메드', '코렌텍', '피제이전자', '이루다', '디알텍', '바텍', '리메드', '필로시스헬스케어',
                       '유앤아이', '레이', '덴티스', '뷰웍스', '하이로닉', '인터로조', '휴비츠', '메타바이오메드', '오스테오닉', '솔고바이오',
                       '셀루메드', '오스템임플란트', '셀바스헬스케어', '비올', '제이브이엠', '클래시스', '지노믹트리', '메디아나', '녹십자엠에스',
                       '아이센스', '레이언스', '마이크로디지탈', '디오', '셀바스AI', '수젠텍', '제테마', '제노레이', '엠아이텍', '이노테라피', '루트로닉',
                       '이오플로우', '인바디', '한스바이오메드', '네오펙트', '원익', '티앤엘', '시너지이노베이션', '루트로닉3우C', '제놀루션', '세종메디칼',
                       '인트로메딕', '엘앤씨바이오', '피플바이오', '지티지웰니스', '원바이오젠', '나이벡', '엘앤케이바이오', '디알젬', '멕아이씨에스',
                       '아스타', '한국비엔씨', '세운메디칼', '젠큐릭스', '코텍', '비덴트', '지에스이', '웰크론한텍', '신원종합개발', '남화토건', '동신건설',
                       '서희건설', '이화공영', '유신', '우원개발', '웰크론', '코리아에스이', '상지카일룸', 'KT서브마린', '삼일기업공사', 'KD', 'KCC건설',
                       'SGC이테크건설', '세보엠이씨', '동원개발', '서한', '특수건설', '일진파워', '금화피에스시', '대원', '희림', '국보디자인', '한양이엔지',
                       '이엠넷', '플레이디', 'SM C&C', '오리콤', '나스미디어', '와이즈버즈', '에코마케팅', '엔비티', '인크로스', '서연탑메탈', '글로벌에스엠',
                       '모베이스전자', '오리엔트정공', '티피씨글로벌', '디젠스', '대동금속', '구영테크', 'SG&G', '세원', '대성파인텍', '광진원텍',
                       '오스템', '대성엘텍', '로스웰', '이원컴포텍', 'KB오토시스', '서진오토모티브', '네오오토', '동아화성', '에코플라스틱', '청보산업',
                       '캐스텍코리아', '대유에이피', '세원물산', '럭슬', '유라테크', '우수AMS', '우리산업홀딩스', '에이팸', '에스제이케이', '이노와이즈',
                       'GH신소재', '에스앤씨엔진그룹', '뉴프라이드', '삼기', '영신금속', '성창오토텍', '케이엔더블유', 'THE MIDONG', '크린앤사이언스',
                       '경창산업', 'OQP', '팬스타엔터프라이즈', '코다코', '유니크', '한일단조', '트루윈', '유니테크노', '화신정공', '엔브이에이치코리아',
                       '일지테크', '현대공업', '코리아에프티', '우리산업', '코프라', '대원산업', '한국아트라스비엑스', '영화테크', '솔루에타', '풍강',
                       '삼보모터스', '모트렉스', '에코캡', '성우하이텍', '네오티스', '평화정공', '골든센츄리', '아진산업', '아이에이', '엠에스오토텍',
                       '한국큐빅', '세동', '시티랩스', '소프트센우', '이엔코퍼레이션', '로지시스', '포스코 ICT', '한국전자인증', '갤럭시아머니트리',
                       '정원엔시스', '소프트센', '에스트래픽', '대신정보통신', '에프앤가이드', '큐로컴', '버킷스튜디오', '링네트', 'SBI핀테크솔루션즈',
                       '한일네트웍스', '케이엘넷', '솔트룩스', '다날', '쌍용정보통신', '오픈베이스', '한네트', '티라유텍', '한국정보인증', '케이씨에스',
                       '세틀뱅크', '씨이랩', '비츠로시스', '이씨에스', '한국전자금융', '팍스넷', '민앤지', '미래테크놀로지', 'NHN한국사이버결제', '엔텔스',
                       '대아티아이', '카페24', '아이티센', '가비아', '나무기술', '데이타솔루션', 'KG이니시스', '엠브레인', '브리지텍', 'KG모빌리언스',
                       '오파스넷', '인포뱅크', '이루온', '위세아이텍', '인포바인', '케이아이엔엑스', '모비릭스', '한솔인티큐브', '와이더플래닛', '핑거',
                       '율호', '수산아이앤티', '미투온', '웹젠', '네오위즈홀딩스', '조이시티', '미투젠', '조이맥스', '썸에이지', '액션스퀘어', '베노홀딩스',
                       'COWON', '아이톡시', 'SNK', '골프존', '룽투코리아', '네오위즈', '선데이토즈', '넷게임즈', '넥슨지티',
                       '플레이위드', '넵튠', '액토즈소프트', '카카오게임즈', '게임빌', '한빛소프트', '베스파', '엠게임', '드래곤플라이',
                       '컴투스', '위메이드', '펄어비스', '데브시스터즈', '코드네이처', '제이씨케미칼', 'SDN', '지엔원에너지', '젬백스지오', '파루',
                       '서남', '윌링스', '에스에너지', '메디앙스', '태양', '비비씨', '경남바이오파마', '케이엠제약', 'TS트릴리온',
                       '모베이스', '해성옵틱스', '인포마크', '블루콤', '성우전자', '멜파스', '크루셜텍', '인탑스', '코스나인', '노바텍', '파인테크닉스',
                       '이즈미디어', '바이오로그디바이스', '이엠앤아이', '코아시아옵틱스', '에스맥', '아이엠텍', '에이치엔티', '하이소닉', 'EMW', '코렌',
                       '엑스큐어', '디케이티', '일야', '에스에이티', '장원테크', 'KH바텍', '시노펙스', '나무가', '세경하이테크', '유아이엘',
                       '아모텍', '유티아이', '한일진공', '캠시스', '이랜텍', '디자인', '이미지스', '디스플레이텍', '우주일렉트로', '액트로',
                       '엔피디', '알에프세미', '재영솔루텍', '와이솔', '엠씨넥스', '슈피겐코리아', '엘컴텍', '디지탈옵틱', '덕우전자', '나노스',
                       '앤디포스', '와이팜', '서원인텍', '코아시아', '동운아나텍', '상신이디피', '에스코넥', '하이비젼시스템', '파트론', '이엠텍',
                       'AP위성', '와이제이엠게임즈', '유테크', '육일씨엔에쓰', '알에프텍', 'KG ETS', '소룩스', '코이즈', '위지트', 'HB테크놀러지',
                       '티엘아이', '선익시스템', '베셀', '아이엠이연이', '이엘피', '상보', '에스엔유', '세진티에스', '아이엘사이언스', '우리조명',
                       '휘닉스소재', '한국컴퓨터', '토비스', '케이맥', '포인트엔지니어링', '아이컴포넌트', '제이엠아이', '한송네오텍', '파인디앤씨',
                       '엘아이에스', '인베니아', 'AP시스템', '이큐셀', 'GRT', '지스마트글로벌', '매직마이크로', '유아이디', '에이아이비트', 'SK머티리얼즈',
                       'APS홀딩스', '제이스텍', '브이원텍', '아나패스', '예선테크', '디아이티', '신화인터텍', '디에스케이', '세미콘라이트',
                       '파인텍', '미래컴퍼니', '덕산테코피아', '신도기연', '우리이앤엘', '삼진엘앤디', '서울바이오시스', '미래나노텍', '이라이콤',
                       '우리바이오', '와이엠씨', '엘이티', '새로닉스', '서울반도체', '동아엘텍', '탑엔지니어링', '힘스', '엘티씨', '쎄미시스코',
                       '넥스트아이', '톱텍', '아이씨디', '비보존 헬스케어', 'DMS', '핌스', '실리콘웍스', '천보', '로체시스템즈', 'GV', '비아트론',
                       '오성첨단소재', '케이피에스', '엘엠에스', '케이엔제이', '루멘스', '티로보틱스', '엘디티', '야스', '디바이스이엔지',
                       '에프엔에스테크', '디이엔티', '제이엠티', '아바코', '필옵틱스', '클라우드에어', '덕산네오룩스', '아바텍', '영우디에스피',
                       '인지디스플레', 'THE E&M', '플리토', '캐리소프트', '티사이언티픽', '아프리카TV', '퓨쳐스트림네트웍스', '줌인터넷',
                       '이화전기', '보성파워텍', '제룡전기', '제룡산업', 'KBI메탈', '피앤씨테크', '세명전기', '지엔씨에너지', '제일전기공업',
                       '비츠로테크', '서전기전', '대한광통신', '비나텍', '양지사', '디지틀조선', '아시아경제', '한류타임즈', '디앤씨미디어',
                       '미스터블루', '오로스테크놀로지', '러셀', '엘비세미콘', '에이티세미콘', '미코', '예스티', '윈팩', '넥스틴', 'WI', '한양디지텍',
                       '테스', '앤씨앤', '아이텍', '램테크놀러지', '인텍플러스', '유니셈', '네온테크', '티씨케이', '오킨스전자', '오디텍', '주성엔지니어링',
                       '성도이엔지', '성우테크론', '바른전자', '이엠네트웍스', '다믈멀티미디어', '테라셈', '윈익홀딩스', '리노공업', '타이거일렉',
                       '코디엠', '아이에이네트웍스', '마이크로컨텍솔', '에이팩트', '에스티아이', '아진엑스텍', '케이엠', '에이피티씨', '원익QnC',
                       '솔브레인홀딩스', '피에스케이홀딩스', '덕산하이메탈', 'KMH하이텍', '월덱스', '뉴파워프리즈마', '엘오티베큠', '엠케이전자',
                       '유니트론텍', 'GST', '하나마이크론', '엑사이엔씨', '오션브릿지', '피델릭스', '코미코', '씨앤지하이테크', '픽셀플러스',
                       '마이크로프랜드', '시스웍', '하나머티리얼즈', '큐에스아이', '프로텍', '동진쎄미켐', '제이티', '유니테스트', '젬백스', '코세스',
                       '원익IPS', '알파홀딩스', '솔브레인', '싸이맥스', '피에스엠씨', '에스앤에스텍', '제너셈', '엑시콘', '어보브반도체', '아이원스',
                       '네오셈', '에이디테크놀로지', '에프에스티', '테크윙', '와이아이케이', '유진테크', '티엘비', 'SFA반도체', '피에스케이', '제주반도체',
                       '엔투텍', '지니틱스', '네패스아크', '텔레칩스', '네패스', '나인테크', '이오테크닉스', '서플러스글로벌', '테스나', '디엔에프',
                       '메카로', '제우스', '시그네틱스', 'ISC', '칩스앤미디어', '티에스이', '기가레인', '엔시트론', '원익홀딩스',
                       '신라섬유', '전파기지국', '프리시젼바이오', '엔케이맥스', '노터스', '얼라인드', '크리스탈지노믹스', '피씨엘', '지더블유바이텍',
                       '캔서롭', '레고켐바이오', '켐온', '바디텍메드', '인트론바이온', 'EDGC', '씨젠', '파나진', '피엔케이피부임상연구센타', '랩지노믹스',
                       '엑세스바이오', '나노엔텍', '일신바이오', '우정바이오', '엔젠바이오', '바이오톡스텍', '휴마시스', '마크로젠', '디엔에이링크',
                       '퀀타매트릭스', '소마젠(Reg.S)', '대한과학', '쎌바이오텍', '셀리버리', '진매트릭스', '티앤알바이오팹', '강스템바이오텍', '파멥신',
                       '펩트론', '유바이오로직스', '신라젠', '유틸렉스', '아시아종묘', '싸이토젠', '농우바이오', '애니젠', '앱클론', '차바이오텍',
                       '바이오리더스', '팬젠', '테고사이언스', '큐리언트', '케어젠', '녹십자셀', '압타머사이언스', '셀레믹스', '제노포커스', '셀리드',
                       '서린바이오', '바이오솔루션', '메디포스트', '아이진', '메디톡스', '고바이오랩', '코아스템', '헬릭스미스', '프로스테믹스', '제넥신',
                       '바이오니아', '아미코젠', '알테오젠', '에이비엘바이오', '올릭스', '오스코텍', '휴젤', '클리노믹스',
                       '하나기술', '엠투아이', '이트론', '우리기술', '이그잭스', '센코', 'ITX-AI', '아모그린텍', '포인트모바일', '뉴프렉스',
                       '유니온커뮤니티', '고영', '슈프리마에이치큐', '에스에이엠티', '코나아이', 'S&K폴리텍', '슈프리마아이디', '모비스', '모다이노칩',
                       '상신전자', '옴니시스템', '액트', '디에이피', '아래스', '에스디시스템', '유일에너테크', '씨엔플러스', '코너스톤네트웍스', '에스텍',
                       '동일기연', '삼양옵틱스', '현우산업', '디티앤씨', '윈텍', '매커스', '이랜시스', '에스티큐브', '위드텍', '아이씨케이',
                       '아이디스홀딩스', '인터플렉스', '제이앤티씨', '다원시스', '아이티엠반도체', '아이디스', '인콘', '백금T&A', '제이씨현시스템',
                       '비에이치', '슈프리마', '에이치시티', '이녹스첨단소재', '옵트론텍', '모아텍', '파크시스템스', '대주전자재료', '심텍', '심텍홀딩스',
                       '에이프로', '세코닉스', '바이오스마트', '라온피플', '카스', '아이엠', '인터엠', '비츠로셀', '상아프론테크', '성호전자', '에스씨디',
                       '디에이테크놀로지',
                       '신화콘텍', '파워넷', '엔에스', '피엔티', '엠플러스', '이노메트리', '피에스텍', '크로바하이텍', '명성티엔에스', '씨아이에스', '동양이엔피',
                       '에코프로비엠', '대보마그네틱', '서울전자통신', '에스피지', '에스퓨얼셀', '파워로직스', '뉴익텍', '신흥에스이씨',
                       '엘앤에프', '피앤이솔루션', '아비코전자', '에이에프더블류', '오르비텍', '하이즈항공', '아스트', '이디티', '샘코', '쎄트렉아이',
                       '빅텍', '아이쓰리시스템', '에이트원', '켄코아에어로스페이스', '유성티엔에스', '레드캡투어', '우리넷', '감마누', '아이크래프트',
                       '인성정보', '텔레필드', '하이트론', '코맥스', '옵티시스', '릭스솔루션', '뉴지랩', '라이트론', '아이즈비전', '스카이문스테크놀로지',
                       '이노와이어리스', '아이앤씨', '유비쿼스홀딩스', '코콤', '알엔투테크놀로지', '에프알텍', '에스넷', '코위버', '머큐리', '기산텔레콤',
                       '현대통신', '인텔리안테크', '피피아이', '삼지전자', 'CS', '유비쿼스', '서진시스템', '우리넴', '빛샘전자', 'RFHIC',
                       '이노인스트루먼트', '오이솔루션', '파이오링크', '텔콘RF제약', '라닉스', '에치에프알', '쏠리드', '메탈라이프', '다산네트웍스',
                       '웨이브일렉트로', '에이스테크', '케이엠더블유', '유비벨록스', '가온미디어', '휴맥스홀딩스', 'TJ미디어', '아리온', '경남제약헬스케어',
                       '디엠티', '삼진', '삼본전자', '홈캐스트', '모바일어플라이언스', '팅크웨어', '휴맥스', '파인디지털', '에이디칩스', '알로이스']

        self.kosPD = ['코스피', '코스닥']


    def get_input(self):
        self.start_date = st.sidebar.date_input("시작일")
        self.end_date = st.sidebar.date_input("종료일", self.start_date + timedelta(days=90))
        self.kospidak = st.sidebar.selectbox("코스피/코스닥", options=self.kosPD)

        if self.kospidak == "코스피":
            self.stock_symbol = st.sidebar.selectbox("종목", options=self.Picompname)
        elif self.kospidak == "코스닥":
            self.stock_symbol = st.sidebar.selectbox("종목", options=self.Dakcompname)

        result = st.sidebar.button("예측시작")
        # self.get_company_name(symbol.upper())
        if result:
            #company_name = self.stock_symbol
            st.header(self.stock_symbol + "의 거래량\n")
            st.sidebar.text("\n")
            st.sidebar.text("\n")
            st.sidebar.text("\n")
            self.bollinger = Bollinger(self.stock_symbol, self.start_date, self.end_date)

            df = self.bollinger.get_dataframe()
            
            df['close'] = df['close'].apply(lambda x: x if x > 0 else 0)
            df['Upper'] = df['Upper'].apply(lambda x: x if x > 0 else 0)
            df['Lower'] = df['Lower'].apply(lambda x: x if x > 0 else 0)
            df['MA'] = df['MA'].apply(lambda x: x if x > 0 else 0)
            
            st.line_chart(df[['close', 'Upper', 'Lower', 'MA']])
            buff, col, buff2 = st.beta_columns([0.1, 0.3, 1])
            #col.write('예측확률 : ')


    #def get_company_name(self, symbol):
        #if symbol == '삼성전자':
            #return '삼성전자'
        #elif symbol == 'KR모터스':
           #return 'KR모터스'

    #def get_data(self, symbol, start, end):
        #if symbol.upper() == '삼성전자':
        #    df = db_query()
        #elif symbol.upper() == 'KR모터스':
        #    df = pd.read_csv("C:/StockWebApp/KR모터스.csv")
        #else:
        #    df = pd.DataFrame(columns=['code', 'date', 'open', 'high', 'low', 'close', 'diff', 'volume'])


        #start = pd.to_datetime(start)
        #end = pd.to_datetime(end)

        #start_row = 0
        #end_row = 0

        #for i in range(0, len(df)):
        #    if start <= pd.to_datetime(df['date'][i]):
        #        start_row = i
        #        break
        #for j in range(0, len(df)):
        #    if end >= pd.to_datetime(df['date'][len(df) - 1 - j]):
        #        end_row = len(df) - 1 - j
        #        break

        #df = df.set_index(pd.DatetimeIndex(df['date'].values))

        #return df.iloc[start_row:end_row + 1, :]

    #def run_prediction(self):
